coocox/Mplib/Toshaba/TMPM36x/TMPM364/cmsis_lib/lib/source/tmpm364_rtc.c
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Date / 10U) * 16U + Date % 10U);
    /* Write date value into DAYR register */
    TSB_RTC->DATER = tmp;
}

/**
  * @brief  Get the date value.
  * @param  NewMode: New mode of RTC
  *   This parameter can be one of the following values:
  *   RTC_CLOCK_MODE, RTC_ALARM_MODE 
  * @retval The date value.
  */
uint8_t RTC_GetDate(RTC_FuncMode NewMode)
{
    uint8_t tmp = 0U;
    uint8_t date = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_FUNC_MODE(NewMode));

    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;

    if (NewMode == RTC_CLOCK_MODE) {
        /* Select PAGE0 */
        TSB_RTC->PAGER = tmp;

        /* Get date value */
        do {
            tmp = TSB_RTC->DATER;
            date = TSB_RTC->DATER;
        }
        while (tmp != date);

    } else {
        /* Select PAGE1 */
        tmp |= PAGER_PAGE_SET;
        TSB_RTC->PAGER = tmp;
        tmp = TSB_RTC->DATER;
    }

    date = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return day value  */
    return date;
}

/**
  * @brief  Set the RTC MONTHR register.
  * @param  Month: New month value, Max 12
  *   This parameter can be one of the following values:
  *   1, 2, 3, ...12 
  * @retval None
  */
void RTC_SetMonth(uint8_t Month)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_MONTH(Month));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Month / 10U) * 16U + Month % 10U);
    /* Write month value into MONTHR register */
    TSB_RTC->MONTHR = tmp;
}

/**
  * @brief  Get the month value.
  * @param  None
  * @retval The month value.
  */
uint8_t RTC_GetMonth(void)
{
    uint8_t tmp = 0U;
    uint8_t month = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    /* Get month value */
    do {
        tmp = TSB_RTC->MONTHR;
        month = TSB_RTC->MONTHR;
    }
    while (tmp != month);

    month = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return month value */
    return month;
}

/**
  * @brief  Set the RTC YEARR register.
  * @param  Year: New year value, Max 99
  *   This parameter can be one of the following values:
  *   0, 1, 2, 3, ...99
  * @retval None
  */
void RTC_SetYear(uint8_t Year)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_YEAR(Year));

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;
    tmp = (uint8_t) ((Year / 10U) * 16U + Year % 10U);
    /* Write year value into YEARR register */
    TSB_RTC->YEARR = tmp;
}

/**
  * @brief  Get the year value.
  * @param  None
  * @retval The year value.
  */
uint8_t RTC_GetYear(void)
{
    uint8_t tmp = 0U;
    uint8_t year = 0U;

    /* Select PAGE0 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    TSB_RTC->PAGER = tmp;

    /* Get year value */
    do {
        tmp = TSB_RTC->YEARR;
        year = TSB_RTC->YEARR;
    }
    while (tmp != year);

    year = (uint8_t) ((tmp >> 4U) * 10U + tmp % 16U);

    /* return year value  */
    return year;
}

/**
  * @brief  Select 24-hour clock or 12-hour clock.
  * @param  HourMode: Select 24-hour clock or 12-hour clock 
  *   This parameter can be one of the following values:
  *   RTC_12_HOUR_MODE, RTC_24_HOUR_MODE
  * @retval None
  */
void RTC_SetHourMode(uint8_t HourMode)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_HOUR_MODE(HourMode));

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Set MONTHR<MO0> to select 24-hour mode/12-hour mode */
    if (HourMode == RTC_12_HOUR_MODE) {
        TSB_RTC_MONTHR_MO0 = (uint32_t) RTC_12_HOUR_MODE;
    } else {
        TSB_RTC_MONTHR_MO0 = (uint32_t) RTC_24_HOUR_MODE;
    }
}

/**
  * @brief  Get hour mode.
  * @param  None
  * @retval mode: The mode of the hour.
  *   This parameter can be one of the following values:
  *   RTC_12_HOUR_MODE, RTC_24_HOUR_MODE 
  */
uint8_t RTC_GetHourMode(void)
{
    uint8_t mode = 0U;

    /* Select PAGE1 */
    mode = TSB_RTC->PAGER;
    mode &= PAGER_PAGE_CLEAR;
    mode |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = mode;

    if (TSB_RTC_MONTHR_MO0 == 1U) {
        mode = RTC_24_HOUR_MODE;
    } else {
        mode = RTC_12_HOUR_MODE;
    }

    return (mode);
}

/**
  * @brief  Set leap-year state.
  * @param  LeapYear: Set leap-year 
  *   This parameter can be one of the following values:
  *   RTC_LEAP_YEAR_0, RTC_LEAP_YEAR_1,
  *   RTC_LEAP_YEAR_2 or RTC_LEAP_YEAR_3 
  * @retval None
  */
void RTC_SetLeapYear(uint8_t LeapYear)
{
    uint8_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_RTC_LEAP_YEAR(LeapYear));

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Set <LEAP1> and <LEAP0> to select leap year state */
    TSB_RTC->YEARR = LeapYear;
}

/**
  * @brief  Get leap-year state from YEARR register.
  * @param  None 
  * @retval The state of leap year.
  */
uint8_t RTC_GetLeapYear(void)
{
    uint8_t tmp = 0U;
    uint8_t leapyear = 0U;

    /* Select PAGE1 */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_PAGE_CLEAR;
    tmp |= PAGER_PAGE_SET;
    TSB_RTC->PAGER = tmp;

    /* Get leap year state */
    do {
        tmp = TSB_RTC->YEARR;
        leapyear = TSB_RTC->YEARR;
    }
    while (tmp != leapyear);

    /* return leap year state  */
    return (leapyear);
}

/**
  * @brief  Set time adjustment + or - 30 seconds.
  * @param  None
  * @retval None
  */
void RTC_SetTimeAdjustReq(void)
{
    uint8_t tmp = 0U;

    /* Set PAGER<ADJUST> */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ADJUST_CLEAR;
    tmp |= PAGER_ADJUST_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Get request state for time adjust.
  * @param  None
  * @retval The state of time adjustment.
  * This parameter can be one of the following values:
  * RTC_REQ or RTC_NO_REQ
  */
RTC_ReqState RTC_GetTimeAdjustReq(void)
{
    uint8_t tmp0 = 0U;
    RTC_ReqState tmp1 = RTC_NO_REQ;

    tmp0 = TSB_RTC->PAGER;
    tmp0 &= PAGER_ADJUST_SET;

    if (tmp0 == PAGER_ADJUST_SET) {
        tmp1 = RTC_REQ;
    } else {
        tmp1 = RTC_NO_REQ;
    }

    return (tmp1);
}

/**
  * @brief  Enable RTC clock function.
  * @param  None
  * @retval None
  */
void RTC_EnableClock(void)
{
    uint8_t tmp = 0U;

    /* Set PAGER<ENATMR> to enable clock function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENATMR_CLEAR;
    tmp |= PAGER_ENATMR_SET;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Disable RTC clock function.
  * @param  None
  * @retval None
  */
void RTC_DisableClock(void)
{
    uint8_t tmp = 0U;

    /* Clear PAGER<ENATMR> to disable clock function */
    tmp = TSB_RTC->PAGER;
    tmp &= PAGER_ENATMR_CLEAR;
    TSB_RTC->PAGER = tmp;
}

/**
  * @brief  Enable RTC alarm function.
  * @param  None
  * @retval None
  */
void RTC_EnableAlarm(void)
{
    uint8_t tmp = 0U;

